
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	// {{ Мымрин С. В.
	ВКМ_КонструкцияФорм.ДобавитьЭлементыНаФормуОбъектаДоговораКонтрагентов(ЭтаФорма, Объект.ВидДоговора);  
	//Мымрин С. В.}}
КонецПроцедуры   


&НаКлиенте
Процедура ВКМ_ВыполнитьДействиеПриИзмененииДанных()  
	
	// {{Мымрин С. В.
	// Процедура показа/сокрытия полей после изменения вида договора 
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		Элементы.ГруппаАО.Видимость = Истина;
	Иначе
		Элементы.ГруппаАО.Видимость = Ложь;
	КонецЕсли;
	//Мымрин С. В.}}

КонецПроцедуры

