
Процедура ДобавитьЭлементыНаФормуОбъектаДоговораКонтрагентов(ЭтаФорма, ВидДоговора) Экспорт

	// {{ Мымрин С. В.

	ГруппаДатаНомер = ЭтаФорма.Элементы.Добавить("ГруппаДатаНомер", Тип("ГруппаФормы"),ЭтаФорма);
	ГруппаДатаНомер.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДатаНомер.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДатаНомер.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаДатаНомер.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Код", Тип("ПолеФормы"),ГруппаДатаНомер);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Код";
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Наименование", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Наименование";
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Организация", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Организация";
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("Контрагент", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Владелец";
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ВидДоговора", Тип("ПолеФормы"),ЭтаФорма);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ВКМ_ВыполнитьДействиеПриИзмененииДанных");
	НовыйЭлемент.ПутьКДанным = "Объект.ВидДоговора"; 
	
	ГруппаАО = ЭтаФорма.Элементы.Добавить("ГруппаАО", Тип("ГруппаФормы"),ЭтаФорма);
	ГруппаАО.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАО.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаАО.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаАО.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ГруппаАО.Видимость = Истина;
	Иначе
		ГруппаАО.Видимость = Ложь;
	КонецЕсли;
		
	ГруппаДаты = ЭтаФорма.Элементы.Добавить("ГруппаДаты", Тип("ГруппаФормы"),ГруппаАО);
	ГруппаДаты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДаты.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаДаты.ОтображатьЗаголовок = ЛОЖЬ; 
	ГруппаДаты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;  
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"),ГруппаДаты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;   
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_Дата";                                       
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ПериодДействия", Тип("ПолеФормы"),ГруппаДаты);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ПериодДействия";                                       
	
	ГруппаЦены = ЭтаФорма.Элементы.Добавить("ГруппаЦены", Тип("ГруппаФормы"),ГруппаАО);
	ГруппаЦены.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЦены.Отображение = ОтображениеОбычнойГруппы.Нет; 
	ГруппаЦены.Заголовок = "Стоимость";
	ГруппаЦены.ОтображатьЗаголовок = Истина; 
	ГруппаЦены.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"),ГруппаЦены);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;  
	НовыйЭлемент.Заголовок = "Абонплата";
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";                                       
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"),ГруппаЦены);
	НовыйЭлемент.Заголовок = "Час работы";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";                                       

	//Мымрин С. В.}}
	
КонецПроцедуры   


Процедура ВставитьКнопкуНаФормуЭлементаРеализация(ЭтаФорма) Экспорт

	// {{ Мымрин С. В.
    // Добавляем команду
	НоваяКоманда = ЭтаФорма.Команды.Добавить("ВКМ_ВыполнитьАвтозаполнение");
	НоваяКоманда.Заголовок = "Автозаполнение";
	НоваяКоманда.Подсказка = "Заполнение ТЧ ""Услуги"" на основании локумента ""Обслуживание клиента"".";
	НоваяКоманда.Действие = "ВКМ_ВыполнитьАвтозаполнение";
	 
	// Добавляем элементы на форму
    МояКартинка = БиблиотекаКартинок.ЗаполнитьФорму;
	Кнопка = ЭтаФорма.Элементы.Добавить("ВКМ_ВыполнитьАвтозаполнение", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
	Кнопка.Заголовок = "Автозаполнение";   
	Кнопка.Отображение = ОтображениеКнопки.КартинкаИТекст; 
	Кнопка.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Право;
	Кнопка.Картинка = МояКартинка;
	Кнопка.ИмяКоманды = "ВКМ_ВыполнитьАвтозаполнение";	

	//Мымрин С. В.}}
	
КонецПроцедуры   


	