
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период.ДатаНачала = ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -1);
	Период.ДатаОкончания = ДобавитьМесяц(КонецМесяца(ТекущаяДата()), -1);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
КонецПроцедуры

&НаСервере
Функция НачатьВыполнениеНаСервере()  

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.ТяжелаяОперация", Период);

КонецФункции

&НаКлиенте
Процедура СоздатьАкты(Команда)

	ДлительнаяОперация = НачатьВыполнениеНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект); 
	 ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
   // Сообщить(ТяжелаяОперация(Период)); 
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Обработка закончена, создано %1 актов.", 
	ПолучитьИзВременногоХранилища(Результат.АдресРезультата))); 
	Элементы.Список.Обновить();
КонецПроцедуры 


 
