
Процедура ОтправитьЗаявки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграм_боту.ТекстСообщения КАК ТекстСообщения,
		|	ВКМ_УведомленияТелеграм_боту.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграм_боту КАК ВКМ_УведомленияТелеграм_боту";
	Выборка = Запрос.Выполнить().Выбрать();
		
	Если Выборка.Количество() > 0 Тогда
		
		Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,,Новый ЗащищенноеСоединениеOpenSSL()); 
		Запрос = Новый HTTPЗапрос(СтрШаблон("/bot%1/sendMessage", Константы.ВКМ_ТокенУправленияТелеграм_ботом.Получить()));
		Запрос.Заголовки.Вставить("Content-Type", "application/json");   
		ИДГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
		Пока Выборка.Следующий() Цикл
			Сообщение = Новый Структура;
			Сообщение.Вставить("chat_id", ИДГруппы);
			Сообщение.Вставить("parse_mode", "html");
			Сообщение.Вставить("text", Выборка.ТекстСообщения);
			JSONДляОтправки = ЗаписатьЗначениеJSON(Сообщение); 
			Запрос.УстановитьТелоИзСтроки(JSONДляОтправки); 
			Результат = Соединение.ОтправитьДляОбработки(Запрос); 
			
			СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия");
			СтруктураСобытий.ИмяСобытия = "Отправка заявки через Телекрамм";

			Если Результат.КодСостояния = 200 Тогда  
		        СтруктураСобытий.ПредставлениеУровня = "Информация";
				СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
				СпрОбъект.Удалить();
			Иначе
				СтруктураСобытий.ПредставлениеУровня = "Ошибка";  
				СтруктураСобытий.Комментарий  = "Код ошибки" + Результат.КодСостояния;
			КонецЕсли;
			СобытияДляЖурналаРегистрации = Новый СписокЗначений();
			СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
			ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);     
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
